loadtest.yml
config:
  target: 'https://ncmt2.dev.amadeus.net'
  phases:
    - duration: 240
      arrivalRate: 30
  defaults:
    headers:
      Content-Type: 'application/x-www-form-urlencoded;charset=UTF-8'
      Accept: 'application/json'
      Authorization: 'Bearer eyJhbGciOiJkaXIiLCJjdHkiOiJKV1QiLCJlbmMiOiJBMTI4Q0JDLUhTMjU2In0..WkkO8JwwC2UFdrsPexe_5Q.5X2lszFr3ddyVnW8NEjCOFQU2Ltx8D0Za2d3PTfld7FJRJIBlaWn9bn2tNMl7AxelCERiHFcb61aqgvHOrOsM5U2Htoxqc9QiKzG47QZ4ALpr_EiMK762jyc6vsLJZ_mXKGfWWM_adtABxG_yuA6IXhk3MDWKLDZ2gm8A-MNIJHaHB8Zxm536JfIaeCzrWLKhNPpj1DIYfquzDY_auqFjiEvVcNsKh_-VyoXHEYIMuxn5Asd16BeNavN2eiRo3HWib4W8w3ZVxsSlBzkWXR8dDR9fy9C1Qkc5fFeTaFq3pYqdcLAZKmDf0txaIUeU770-yxK7AMAzYYxCfb8X2vPYvFGHiqhWfuIVeGYD1x3vEa9TQB6AXc1qQozvaCmCS-RlCWlL4Ev8tAzCWpD7WRXOA.q6omuhVwKDY31ZtNwA9ldw'
scenarios:
  - flow:
    - post:
        url: "/cmt2web/apf/mobile/v1/trips/triplistRefresh?LANGUAGE=FR&SITE=NCMTNCMT&OCTX=TCUAT"
        form:
          data: "{}"